src/cf/Reports/ТЦАнализЗамеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ТЦАнализЗамеров</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/ЗамерыВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЗамерыВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЗамера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписиЛокальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючеваяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючевыеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаЗамера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписиНачалоЧаса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ПрофилиКлючевыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ПрофилиКлючевыхОпераций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КлючевыеОперацииПрофиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючеваяОперация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючевыеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеВремя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Reports/ТЦАнализЗамеров/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрДанныхПрофиль = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Профиль");
	ПрофильНастройкаПользовательская = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанныхПрофиль.ИдентификаторПользовательскойНастройки);
	
	Если ПрофильНастройкаПользовательская.Использование Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации КАК НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ КАК КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ КАК ПериодЗамера,
		               |	Замеры.КлючеваяОперация КАК КлючеваяОперация,
		               |	КлючевыеОперации.ЦелевоеВремя КАК ЦелевоеВремя,
		               |	КлючевыеОперации.Приоритет КАК Приоритет,
		               |	Замеры.Пользователь КАК Пользователь,
		               |	МИНИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМинимальное,
		               |	МАКСИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМаксимальное,
		               |	СУММА(Замеры.ВремяВыполнения) КАК ВремяВыполненияСуммарное,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения <= Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения > Замеры.КлючеваяОперация.ЦелевоеВремя
		               |					И Замеры.ВремяВыполнения <= 4 * Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 0.5
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т4_Пополам,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЕСТЬNULL(Замеры.ДатаЗаписи, 0) = 0
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК КоличествоЗамеров,
		               |	ВЫБОР
		               |		КОГДА КОЛИЧЕСТВО(*) < 2
		               |			ТОГДА 0
		               |		ИНАЧЕ (СУММА(Замеры.ВремяВыполнения * Замеры.ВремяВыполнения) - 2 * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СУММА(Замеры.ВремяВыполнения) + КОЛИЧЕСТВО(*) * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СРЕДНЕЕ(Замеры.ВремяВыполнения)) / (КОЛИЧЕСТВО(*) - 1)
		               |	КОНЕЦ КАК Дисперсия
		               |ИЗ
		               |	Документ.ТЦТест.ПроизводительностьИтераций КАК ТЦТестПроизводительностьИтераций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗамерыВремени КАК Замеры
		               |		ПО ТЦТестПроизводительностьИтераций.ДатаНачалаИтерации <= Замеры.ДатаЗаписи
		               |			И ТЦТестПроизводительностьИтераций.ДатаОкончанияИтерации >= Замеры.ДатаЗаписи
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиКлючевыхОпераций.КлючевыеОперацииПрофиля КАК КлючевыеОперации
		               |		ПО (КлючевыеОперации.Ссылка = &Профиль)
		               |			И (Замеры.КлючеваяОперация = КлючевыеОперации.КлючеваяОперация)
		               |ГДЕ
		               |	ТЦТестПроизводительностьИтераций.Ссылка = &Тест
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ,
		               |	Замеры.КлючеваяОперация,
		               |	КлючевыеОперации.ЦелевоеВремя,
		               |	КлючевыеОперации.Приоритет,
		               |	Замеры.Пользователь";
					   
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации КАК НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ КАК КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ КАК ПериодЗамера,
		               |	Замеры.КлючеваяОперация КАК КлючеваяОперация,
		               |	Замеры.КлючеваяОперация.ЦелевоеВремя КАК ЦелевоеВремя,
		               |	Замеры.КлючеваяОперация.Приоритет КАК Приоритет,
		               |	Замеры.Пользователь КАК Пользователь,
		               |	МИНИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМинимальное,
		               |	МАКСИМУМ(Замеры.ВремяВыполнения) КАК ВремяВыполненияМаксимальное,
		               |	СУММА(Замеры.ВремяВыполнения) КАК ВремяВыполненияСуммарное,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения <= Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т,
		               |	СУММА(ВЫБОР
		               |			КОГДА Замеры.ВремяВыполнения > Замеры.КлючеваяОперация.ЦелевоеВремя
		               |					И Замеры.ВремяВыполнения <= 4 * Замеры.КлючеваяОперация.ЦелевоеВремя
		               |				ТОГДА 0.5
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Т4_Пополам,
		               |	СУММА(ВЫБОР
		               |			КОГДА ЕСТЬNULL(Замеры.ДатаЗаписи, 0) = 0
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК КоличествоЗамеров,
		               |	ВЫБОР
		               |		КОГДА КОЛИЧЕСТВО(*) < 2
		               |			ТОГДА 0
		               |		ИНАЧЕ (СУММА(Замеры.ВремяВыполнения * Замеры.ВремяВыполнения) - 2 * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СУММА(Замеры.ВремяВыполнения) + КОЛИЧЕСТВО(*) * СРЕДНЕЕ(Замеры.ВремяВыполнения) * СРЕДНЕЕ(Замеры.ВремяВыполнения)) / (КОЛИЧЕСТВО(*) - 1)
		               |	КОНЕЦ КАК Дисперсия
		               |ИЗ
		               |	Документ.ТЦТест.ПроизводительностьИтераций КАК ТЦТестПроизводительностьИтераций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗамерыВремени КАК Замеры
		               |		ПО ТЦТестПроизводительностьИтераций.ДатаНачалаИтерации <= Замеры.ДатаЗаписи
		               |			И ТЦТестПроизводительностьИтераций.ДатаОкончанияИтерации >= Замеры.ДатаЗаписи
		               |ГДЕ
		               |	ТЦТестПроизводительностьИтераций.Ссылка = &Тест
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТЦТестПроизводительностьИтераций.НомерИтерации,
		               |	ТЦТестПроизводительностьИтераций.КоличествоВРМ,
		               |	ВЫБОР &ПериодичностьЗамеров
		               |		КОГДА 1
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), МИНУТА)
		               |		КОГДА 2
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ЧАС)
		               |		КОГДА 3
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), ДЕНЬ)
		               |		КОГДА 4
		               |			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(2015, 1, 1), СЕКУНДА, Замеры.ДатаНачалаЗамера / 1000 - 63555667200), НЕДЕЛЯ)
		               |		КОГДА 5
		               |			ТОГДА &ПериодНет
		               |	КОНЕЦ,
		               |	Замеры.КлючеваяОперация,
		               |	Замеры.КлючеваяОперация.ЦелевоеВремя,
		               |	Замеры.КлючеваяОперация.Приоритет,
		               |	Замеры.Пользователь";
		
	КонецЕсли;
	
	СхемаКомпоновкиДанных.НаборыДанных.ЗамерыТеста.Запрос = ТекстЗапроса;
		
КонецПроцедуры
